In [2]:
import pandas as pd
import numpy as np

c:\Users\yorda\anaconda3\envs\programmingexpert\Lib\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

# Task 1

In [4]:
data = {
    'Product': ['A', 'A','A', 'B', 'B','B','C', 'C','D','D'],
    'Sales': [42, 43, 21, 32, 18, 39, 20, 54, 72, 80,]
}

df = pd.DataFrame(data)
df

  Product  Sales
0       A     42
1       A     43
2       A     21
3       B     32
4       B     18
5       B     39
6       C     20
7       C     54
8       D     72
9       D     80

In [6]:
grouped = df.groupby('Product')
grouped['Sales'].sum()

Product
A    106
B     89
C     74
D    152
Name: Sales, dtype: int64

# Task 2

In [7]:
data = {
    'Class': ['Math', 'Science', 'Math', 'Science', 'Math', 'Science'],
    'Score': [85, 90, 78, 88, 92, 95]
}
df = pd.DataFrame(data)
df

     Class  Score
0     Math     85
1  Science     90
2     Math     78
3  Science     88
4     Math     92
5  Science     95

In [8]:
grouped = df.groupby('Class')
grouped['Score'].min()

Class
Math       78
Science    88
Name: Score, dtype: int64

In [9]:
grouped = df.groupby('Class')
grouped['Score'].max()

Class
Math       92
Science    95
Name: Score, dtype: int64

In [10]:
grouped = df.groupby('Class')
grouped['Score'].mean()

Class
Math       85.0
Science    91.0
Name: Score, dtype: float64

# Task 3

In [11]:
data = {
    'OrderID': [101, 102, 103, 104, 105, 106],
    'Category': ['Electronics', 'Clothing', 'Electronics', 'Clothing', 'Electronics', 'Furniture']
}
df = pd.DataFrame(data)
df

   OrderID     Category
0      101  Electronics
1      102     Clothing
2      103  Electronics
3      104     Clothing
4      105  Electronics
5      106    Furniture

In [12]:
grouped = df.groupby('Category')
grouped['OrderID'].size()

Category
Clothing       2
Electronics    3
Furniture      1
Name: OrderID, dtype: int64

# Tasks on drinks dataset

In [3]:
df = pd.read_csv("https://raw.githubusercontent.com/geekcourses/JupyterNotebooksExamples/master/datasets/various/drinks.csv")
df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

#### Task 1: Calculate the average beer servings for each continent.

In [18]:
grouped = df.groupby("continent")
grouped["beer_servings"].mean()

continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

#### Task 2: Which continent consumes max wine in total

In [29]:
wine_consumption_per_continent = df.groupby('continent')['wine_servings'].sum()
max_wine_continent = wine_consumption_per_continent.idxmax()
print(max_wine_continent)

EU

#### Task 3: Identify the country with the highest beer servings within each continent.

In [39]:
top_country_per_continent = df.groupby('continent')['beer_servings'].idxmax()
top_country_df = df.loc[top_country_per_continent]

print(top_country_df[['continent', 'country', 'beer_servings']])

    continent             country  beer_servings
117        AF             Namibia            376
141        AS  Russian Federation            247
45         EU      Czech Republic            361
129        OC               Palau            306
188        SA           Venezuela            333

#### Task 4: Calculate the sum of all alcoholic beverage servings (beer, spirit, wine) by continent.

In [5]:
servings_by_continent = df.groupby('continent')[['beer_servings', 'spirit_servings', 'wine_servings']].sum()

print("Sum of All Alcoholic Beverage Servings by Continent:")
print(servings_by_continent)

Sum of All Alcoholic Beverage Servings by Continent:
           beer_servings  spirit_servings  wine_servings
continent
AF                  3258              866            862
AS                  1630             2677            399
EU                  8720             5965           6400
OC                  1435              935            570
SA                  2101             1377            749

#### Task 5: Find countries where the total litres of pure alcohol is above the global average.

In [8]:
new_df = df[['country', 'total_litres_of_pure_alcohol']]
print(new_df)

         country  total_litres_of_pure_alcohol
0    Afghanistan                           0.0
1        Albania                           4.9
2        Algeria                           0.7
3        Andorra                          12.4
4         Angola                           5.9
..           ...                           ...
188    Venezuela                           7.7
189      Vietnam                           2.0
190        Yemen                           0.1
191       Zambia                           2.5
192     Zimbabwe                           4.7

[193 rows x 2 columns]